NSArray *city = @[@[@"北京",@"上海",@"广州",@"杭州",@"深圳",@"武汉",@"重庆",@"成都",@"南京",@"西安"],//热门城市
                      @[@"鞍山",@"安康",@"安庆",@"安顺",@"安阳"],//A开头
                      @[@"巴彦淖尔",@"巴中",@"白山",@"白银",@"百色",@"蚌埠",@"包头",@"保定",@"保山",@"宝鸡",@"北海",@"北京",@"本溪",@"滨州",@"毫州"],//B开头
                      @[@"沧州",@"昌吉",@"常德",@"常州",@"长春",@"长沙",@"长治",@"潮州",@"郴州",@"成都",@"承德",@"池州",@"赤峰",@"滁州",@"慈溪",@"重庆"],//C开头
                      @[@"达州",@"大理",@"大连",@"大庆",@"大同",@"丹东",@"德阳",@"德州",@"迪庆",@"定西",@"东营",@"东莞",@"石河子",@"儋州"],//D开头
                      @[@"阿克苏",@"鄂尔多斯",@"鄂州",@"恩施"],//E开头
                      @[@"防城港",@"佛山",@"福州",@"抚顺",@"抚州",@"阜新",@"阜阳"],//F开头
                      @[@"赣州",@"固原",@"广安",@"广元",@"广州",@"桂林",@"贵港",@"贵阳"],//G开头
                      @[@"哈尔滨",@"海口",@"邯郸",@"汉中",@"杭州",@"菏泽",@"合肥",@"河池",@"河源",@"鹤壁",@"鹤岗",@"贺州",@"衡阳",@"红河",@"呼和浩特",@"葫芦岛",@"湖州",@"怀化",@"淮安",@"淮北",@"淮南",@"黄冈",@"黄山",@"黄石",@"惠州"],//H开头
                      @[@"鸡西",@"吉安",@"吉林",@"济南",@"济宁",@"济源",@"嘉兴",@"嘉峪关",@"佳木斯",@"江门",@"江山",@"焦作",@"揭阳",@"金昌",@"金华",@"锦州",@"晋城",@"晋中",@"荆门",@"荆州",@"景德镇",@"靖江",@"九江",@"酒泉"],//J开头
                       @[@"喀什",@"开封",@"开原",@"昆明",@"昆山"],//k开头
                      @[@"拉萨",@"莱芜",@"兰州",@"兰州",@"廊坊",@"乐山",@"丽江",@"丽水",@"连云港",@"聊城",@"辽阳",@"辽源",@"临沧",@"临汾",@"临夏",@"临沂",@"柳州",@"六安",@"六盘水",@"龙岩",@"陇南",@"娄底",@"吕梁",@"洛阳",@"泸州",@"漯河"],//L开头
                       @[@"马鞍山",@"茂名",@"梅州",@"眉山",@"绵阳",@"牡丹江"],//M开头
                      @[@"南昌",@"南充",@"南京",@"南宁",@"南平",@"南通",@"南阳",@"内江",@"宁波",@"宁德"],//N开头
                      @[@"攀枝花",@"盘锦",@"萍乡",@"平顶山",@"平凉",@"莆田",@"普洱",@"濮阳"],//P开头
                      @[@"齐齐哈尔",@"潜江",@"钦州",@"秦皇岛",@"青岛",@"清远",@"庆阳",@"琼海",@"曲靖",@"泉州",@"衢州"],//Q开头
                      @[@"日照"],//R开头
                      @[@"三河",@"三门峡",@"三明",@"三亚",@"汕头",@"汕尾",@"商洛",@"商丘",@"上海",@"上饶",@"韶关",@"邵阳",@"绍兴",@"深圳",@"沈阳",@"十堰",@"石家庄",@"石嘴山",@"四平",@"松原",@"苏州",@"宿迁",@"随州",@"绥化",@"遂宁"],//S开头
                       @[@"台州",@"泰安",@"泰州",@"太原",@"唐山",@"天津",@"天门",@"天水",@"铁岭",@"通化",@"通辽",@"铜川",@"铜陵",@"铜仁"],//T开头
                      @[@"万宁",@"威海",@"潍坊",@"渭南",@"温州",@"文山",@"乌海",@"乌兰察布",@"乌鲁木齐",@"无锡",@"芜湖",@"梧州",@"武汉",@"武威"],//W开头
                      @[@"西安",@"西宁",@"西双版纳",@"锡林郭勒",@"锡林浩特",@"厦门",@"仙桃",@"咸宁",@"咸阳",@"襄阳",@"湘潭",@"湘西",@"孝感",@"新乡",@"新余",@"忻州",@"信阳",@"兴化",@"邢台",@"徐州",@"许昌",@"宣城"],//X开头
                      @[@"雅安",@"烟台",@"盐城",@"延安",@"延边",@"扬州",@"洋浦市",@"阳江",@"阳泉",@"伊春",@"伊犁",@"宜宾",@"宜昌",@"宜春",@"益阳",@"银川",@"银潭",@"营口",@"永州",@"榆林",@"玉林",@"玉溪",@"岳阳",@"云浮",@"运城",@"兖州"],//Y开头

                      @[@"朝阳",@"枣庄",@"湛江",@"漳州",@"张家界",@"张家口",@"张掖",@"肇庆",@"镇江",@"郑州",@"中山",@"舟山",@"周口",@"珠海",@"株洲",@"驻马店",@"资阳",@"淄博",@"自贡",@"遵义"]//Z开头

                      ];